<template>
    <div class="py-4 md:py-8 max-w-[323px] md:max-w-[880px] mx-auto">
        <div>
            <p class="text-Neutral-900 text-sm mb-8">
                <NuxtLink to="/" class="text-xs text-Neutral-600-Dark-Primary">Home</NuxtLink>&nbsp; / &nbsp;
                隱私權保護政策
            </p>

            <div class="flex gap-x-8">
                <NuxtLink to="/privacy" class="font-medium">隱私權保護政策</NuxtLink>
                <NuxtLink to="/terms-of-service" class="font-medium">服務條例</NuxtLink>
            </div>
        </div>

        <div class="mt-4 md:mt-7">
            <div class="flex flex-col gap-y-8">
                <div>
                    <h1 class="text-2xl font-medium text-Neutral-900">隱私權保護政策</h1>
                    <p class="text-Neutral-700 text-xs mt-2">最後修改日期：2024年03月15日</p>
                </div>

                <div class="text-sm text-Neutral-800">
                    <p>
                        idea2gether為愛上大數據股份有限公司(以下簡稱「本網站」）所經營管理之網路平台，我們非常重視用戶的隱私權，因此制訂了此線上隱私權保護政策。請您細讀以下有關隱私權保護政策的內容，若您對於隱私權聲明或與個人資料有關之相關事項有任何疑問，可以利用電子郵件與我們聯絡，羅芙奧將儘快回覆說明。
                    </p>
                </div>

                <div class="text-sm text-Neutral-800">
                    <h2 class="text-xl font-medium mb-2">‧ ️線上隱私權保護政策的適用範圍</h2>
                    <p>
                        線上隱私權保護政策內容，包括本網站如何處理在用戶使用網站服務時收集到的身份識別資料，也包括本網站如何處理在商業伙伴與本網站合作時分享的任何身份識別資料，線上隱私權保護政策不適用於本網站以外的公司，也不適用於非本網站所僱用或管理的人員。<br />
                        本政策所涵蓋之範圍包括所有本網站（idea2gether.com）所向您蒐集個人資訊及其後續之利用、處理行為，包含：使用者名稱、年齡、性別、職業、通訊地址、
                        Email 與連絡電話，或其他您註冊時或其後所同意嘖嘖蒐集之個人資訊。
                        本政策之效力範圍僅及於本網站，若您點選第三人網站之連結或廣告，拜訪各該網站或網頁時，應依各該網站或網頁之經營者所定之隱私權政策規定處理，與嘖嘖無涉。<br />
                        於使用idea2gether本網站所提供之服務前，請確認您能確實遵守本政策所列全部條款，若您不同意全部或部分者，則請勿使用本網站服務。
                    </p>
                </div>

                <div class="text-sm text-Neutral-800">
                    <h2 class="text-xl font-medium mb-2">‧ ️資料收集與使用方式</h2>
                    <p>
                        原則上，使用者進入本網站時，並不需要輸入個人資料，例如姓名或電子郵件地址等，除非明確告知，本網站不會在使用者不知情的情況下，取得使用者此等個人資料。<br />
                        <br />
                        本網站會自動接收並記錄使用者瀏覽網站的IP位址，瀏覽器相關設定以及在網站內的瀏覽活動等資料，但是這些資料僅供作流量分析和網路行為調查，以便於改善本網站的服務品質，這些資料也只是總量上的分析，不會和特定個人相聯繫。
                        在某些情況下，例如當使用者要求加入會員、訂閱電子報、參加活動或其他服務時，本網站可能會要求使用者登錄個人資料，以便於和使用者聯繫、完成交易、提供服務或處理訂閱程序。本網站也可以從商業夥伴處取得個人資料。
                        <br />
                        <br />
                        當您在本網站註冊時，我們可能會問及您的姓名、電子郵件地址、出生日期、性別、職位、行業及個人興趣等資料。您在本網站註冊成功，並登入使用我們的服務後，我們就會認識您。在此等情況下，本網站將明白告知使用者此等事實，如果使用者選擇不接收任何聯繫資訊，本網站將完全予以尊重
                        <br />
                        <br />
                        使用者通訊─當您傳送電子郵件或其他通訊給本網站時，我們會保留這些通訊，以便處理您的查詢、回覆您的要求並提昇服務品質。
                        <br />
                        <br />
                        本網站只會根據本《線上隱私權政策》和／或特定服務的增補隱私權聲明中所描述的用途來處理個人資訊。除了上述項目之外，此類用途還包括：
                        <br />
                        <br />
                        * 向使用者提供我們的服務，包括顯示自訂內容 <br />
                        * 審核、研究及分析，以便維護、保護及改善我們的服務 <br />
                        * 確認我們的技術功能<br />
                        * 開發新服務 <br />
                        * 完成您對某項產品的要求<br />
                        * 通知您特別活動或新產品
                    </p>
                </div>

                <div class="text-sm text-Neutral-800">
                    <h2 class="text-xl font-medium mb-2">‧ ️️資料分享以及公開方式</h2>
                    <p>
                        本網站所取得的個人資料，都僅供本網站於其內部，或依照原來所說明的使用目的和範圍。除非事先說明，或依照相關法律規定，否則本網站不會將使用者個人資料提供給第三人，或移作其他目的使用。本網站不會向任何人出售或出借您的個人識別資料。
                        <br />
                        <br />
                        在以下的情況下，本網站會向政府機關、其他人士或公司提供您的個人識別資料： <br />
                        * 與其他人士或公司共用資料前取得您的同意。 <br />
                        * 需要與其他人士或公司共用您的資料，才能夠提供您要求的產品或服務。 <br />
                        *
                        向代表本網站提供服務或產品的公司提供資料，以便向您提供產品或服務（若我們沒有事先通知您，這些公司均無權使用我們提供的個人資料，作提供產品或服務以外的其他用途）。
                        <br />
                        * 應遵守法令或政府機關的要求 <br />
                        * 我們發覺您在網站上的行為違反本網站/本公司服務條款或產品、服務的特定使用指南。
                        <br />
                        <br />
                        為了保護使用者個人隱私，我們無法為您查詢其他使用者的帳號資料，請您見諒！若您有相關法律上問題需查閱他人資料時，請務必向警政單位提出告訴，我們將全力配合警政單位調查並提供所有相關資料，以協助調查及破案！
                    </p>
                </div>

                <div class="text-sm text-Neutral-800">
                    <h2 class="text-xl font-medium mb-2">‧ ️️️Cookie</h2>
                    <p>Cookie是從網站伺服器傳送到您的瀏覽器，並保存在電腦中具有識別功能的少量資料。</p>
                </div>

                <div class="text-sm text-Neutral-800">
                    <h2 class="text-xl font-medium mb-2">‧ ️關於cookie的選擇</h2>
                    <p>
                        大部分瀏覽器都預設為接收cookie，但為了保障您的隱私，您的瀏覽器預設只會允許網站取用本身傳送的cookie而並非由其他網站傳送的cookie。<br />
                         您可以重設瀏覽器以拒絕所有cookie，或在傳送cookie時顯示通知。<br />
                         如果選擇拒絕所有的cookie，您就無法使用某些必須登入或儲存偏好設定的本網站之服務。但即使您不接受cookies，仍然可以使用許多不需cookie的網站，本網站也有很多服務是不必使用cookie的。
                    </p>
                </div>

                <div class="text-sm text-Neutral-800">
                    <h2 class="text-xl font-medium mb-2">‧ ️️關於cookie的使用方式</h2>
                    <p>
                        為便於提供更適合使用者個人需要的服務，本網站可能使用cookie技術作為以下幾種用途： <br />
                        * 在您「登入」時取用您的資料，並根據您的身分提供專屬的服務。<br />
                        * 記錄您在使用服務時的喜好或習慣，例如您的語言或貨幣偏好。 <br />
                        * 估算並報告總瀏覽人次及流量。<br />
                        * 研究如何提供更優質的內容及服務。<br />
                        * 要求您在經過一段特定期間後重新輸入本網站密碼，以確保其他人不會意外進入您的帳號並取得資料。
                    </p>
                </div>

                <div class="text-sm text-Neutral-800">
                    <h2 class="text-xl font-medium mb-2">‧ ️️修改個人帳號資料及偏好設定的權力</h2>
                    <p>
                        使用者個人資料有變更、或發現個人資料不正確的時候，可以隨時在本網站網站中要求更正，本網站賦予您在任何時候修改個人本網站帳號資料及偏好設定的權力，包括接受本網站通知您特別活動或新產品的決定權。
                    </p>
                </div>

                <div class="text-sm text-Neutral-800">
                    <h2 class="text-xl font-medium mb-2">‧ ️️安全性</h2>
                    <p>
                        為保障您的隱私及安全，您的本網站帳號資料會用密碼保護。在部分情況下本網站使用通行標準的SSL
                        (Secure Socket
                        Layer)加密機制，保障資料傳送的安全。我們採取適當的安全措施，以防止未經授權存取、竄改、披露或毀損資料，其中包括資料收集、儲存、處理實務和安全措施的內部審查，以及實體的安全措施，以防止我們儲存個人資料的系統遭到未經授權的存取。我們只允許本網站員工、承包商和代理人存取個人資料，因為他們需要這些資訊來提供、開發或改善我們的服務。上述人員都必須遵守機密性義務，否則可能遭到懲戒，包括終止合約和刑事起訴等等。本網站將盡力以合理之技術及程序，保障所有個人資料之安全。
                    </p>
                </div>

                <div class="text-sm text-Neutral-800">
                    <h2 class="text-xl font-medium mb-2">‧ ️保護孩童的個人資訊 </h2>
                    <p>本網站網站是適合於一般使用對象的網站，不會故意向孩童蒐集任何個人資訊。</p>
                </div>

                <div class="text-sm text-Neutral-800">
                    <h2 class="text-xl font-medium mb-2">‧ ️️隱私權保護政策修訂</h2>
                    <p>
                        請注意，本《線上隱私權政策》會不時更改。我們不會在未經您同意的狀況下，減免您對本《線上隱私權政策》的權利，我們期望此類變更不會造成太大的影響。無論如何，我們會將《線上隱私權政策》的所有變更都張貼在此網頁上，如果是重大變更，我們將提供顯著的通知（甚至針對某些服務提供《線上隱私權政策》變更的電子郵件通知）。本《線上隱私權政策》的每個版本都會在網頁上方顯示其生效日期，我們也會將本《線上隱私權政策》的先前版本保留在封存中以供您檢閱。
                    </p>
                </div>

                <div class="text-sm text-Neutral-800">
                    <h2 class="text-xl font-medium mb-2">‧ ️建議</h2>
                    <p>
                        如有任何看法與建議，您可透過電子郵件(idea2gether-service@gmail.com)或到聯絡我們頁面填寫資料並告訴我們。
                    </p>
                </div>
            </div>
        </div>
    </div>
</template>

<script setup></script>

<style scoped lang="scss">
.router-link-active {
    border-bottom: 2px solid #6b56ca;
    padding-bottom: 12px;
    color: #6b56ca;
}
</style>
